app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "chad"]]
---
  def login
    credentials = login_params
    user = User.find_by email: credentials[:email]

INSERT INTO "users" ("username", "email", "password_digest", "first_name", "last_name", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save