app/controllers/pictures_controller.rb

  def show
    # Find the user for this picture
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]

  def create
    # use strong params to make sure that users dont do a SQL injection attack
    @picture = @current_user.pictures.new(picture_params)
    if @picture.save
---
INSERT INTO "pictures" ("name", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @picture = @current_user.pictures.find(params[:id])
    @picture.destroy
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."user_id" = $1 AND "pictures"."id" = $2 LIMIT 1  [["user_id", 4], ["id", 4]]
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 4]]