app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # all the users
    @users = User.all